app/controllers/rooms_controller.rb

SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`public` = 1 ORDER BY created_at DESC LIMIT 10
---
  def index
    @rooms = Room.where(:public => true).order("created_at DESC").limit(10)

INSERT INTO `rooms` (`name`, `sessionId`, `public`, `created_at`, `updated_at`) VALUES ('shareef', '1_MX4zNjY4NzJ-MTI3LjAuMC4xflR1ZSBPY3QgMjMgMDI6MDc6MzQgUERUIDIwMTJ-MC4wMzU4MzE0NX4', 1, '2012-10-23 09:07:34', '2012-10-23 09:07:34')
---
  def create
    config_opentok
    session = @opentok.create_session request.remote_addr
    params[:room][:sessionId] = session.session_id

    @new_room = Room.new(params[:room])

    respond_to do |format|
      if @new_room.save

SELECT `rooms`.* FROM `rooms` WHERE (`rooms`.`id` = 2181505840) LIMIT 1
---
  def party
    @room = Room.find(params[:id])